{
  "profile": {
    "name": "Muttahhid Jomeer",
    "title": "Senior Software Engineer",
    "image": "/pp.png",
    "email": "info@muttahhid.com",
    "phone": "+230 59495913",
    "location": "Port Louis, Mauritius"
  },
  "about": {
    "introduction": "I'm a dedicated software engineer with over 5 years of experience in developing web applications and scalable backend services. My journey in software development began when I was in college, building small projects that eventually grew into a passion for creating robust, user-friendly applications.",
    "education": "I hold a Bachor's degree in Computing from British Computer Society, where I specialized in distributed systems, cloud computing and much more. This educational background, combined with my professional experience, has equipped me with a strong foundation in both theoretical concepts and practical application development.",
    "interests": "When I'm not coding, you can find me hiking in the mountains, reading about new technologies, or contributing to open-source projects. I believe in continuous learning and staying updated with the latest trends in the tech industry.",
    "experience": [{
        "title": "Application Development Senior Analyst",
        "company": "Accenture",
        "period": "Jun 2024 - Present",
        "description": "Led the design and architecture of complex solutions, bridging business needs with technical specifications. I mentored team members, promoted DevOps best practices, and proactively managed risks to deliver secure, high-quality software.  I also explored and piloted innovative AI technologies through POC projects."
      },
      {
        "title": "Application Development Analyst",
        "company": "Accenture",
        "period": "Oct 2022 - May 2022",
        "description": "Analyzed business requirements to design scalable Java solutions using frameworks like Spring and Hibernate, ensuring alignment with technical and business goals. Maintained high code quality through JUnit testing and streamlined deployments by building CI/CD pipelines with Jenkins. Actively involved in Agile processes, collaborated with cross-functional teams to deliver seamless solutions and led the implementation of new features and enhancements."
      },
      {
        "title": "Web Engineer",
        "company": "Nova Interaction",
        "period": "Jun 2020 - Sept 2022",
        "description": "Planned and developed websites by transforming mockups into functional web presences using HTML, JavaScript, CSS, and Joomla. Integrated third-party APIs, such as Microsoft Graph API and Zoho, through custom Joomla components, modules, and plugins, and managed efficient SQL queries and data transport. My responsibilities included overseeing computer operation scheduling, backup, and data management, as well as collaborating with web designers to deliver innovative UI designs. Trained and supervised team members, and led projects from initial research through testing and implementation phases, ensuring seamless delivery and alignment with business objectives"
      },
      {
        "title": "Web Developer",
        "company": "Nova Interaction",
        "period": "Feb 2019 - May 2020",
        "description": "Started as an intern and grew into a full-time role, working on frontend development with JavaScript and gradually learning backend technologies like PHP as well as server/database administration. Had various opportunities of exploring trending technologies like the AR/VR, machine learning algorithms and applying those concepts into prototypes."
      }
    ]
  },
  "skills": [{
      "name": "Frontend",
      "skills": ["React", "JavaScript", "JQuery", "Angular", "Tailwind CSS", "HTML/CSS", "UIKit"]
    },
    {
      "name": "Backend",
      "skills": ["PHP", "Java", "Python"]
    },
    {
      "name": "Database",
      "skills": ["PostgreSQL", "MySQL", "ELK", "Spring Data"]
    },
    {
      "name": "DevOps",
      "skills": ["Docker", "AWS", "CI/CD", "Linux", "Jenkins", "Microservices"]
    },
    {
      "name": "Tools",
      "skills": ["Git", "VS Code", "Jira", "Figma", "Postman", "SoapUI", "Eclipse", "IntelliJ", "Tomcat"]
    }
  ],
  "achievements": {
    "highlights": [{
        "title": "Introduction to IOT driven Home and Industrial Automation using Raspberry Pi",
        "organization": "Mauritius Research Council",
        "year": "2017",
        "description": "Achieving prototypes with sensors and raspberry pi with python"
      },
      {
        "title": "Google Code-in",
        "organization": "Google",
        "year": "2017",
        "description": "Contributed key improvements to a popular library - Ubuntu."
      }
    ],
    "certificates": [{
        "name": "Cybrary - Penetration Testing and Ethical Hacking",
        "issuer": "Cybrary",
        "year": "2019",
        "image": "/photo-1461749280684-dccba630e2f6",
        "description": "Professional certification validating expertise Penetration Testing and Ethical Hacking"
      },
      {
        "name": "Micro Certification - Fundamental Cryptography",
        "issuer": "Cybrary",
        "year": "2018",
        "image": "/photo-1487058792275-0ad4aaf24ca7",
        "description": "Foundation Course for undestanding different concepts of Cryptography."
      },
      {
        "name": "Cybrary - Introduction to SQL",
        "issuer": "Cybrary",
        "year": "2019",
        "image": "/photo-1498050108023-c5249f4df085",
        "description": "Demonstrates proficiency SQL development and optimization."
      },
      {
        "name": "Cybrary - CompTIA Cloud +",
        "issuer": "Cybrary",
        "year": "2019",
        "image": "/photo-1487058792275-0ad4aaf24ca7",
        "description": "Expert-level Course for undestanding different concepts of Cloud Computing."
      },
      {
        "name": "Cybrary - Intermediate Cloud Security",
        "issuer": "Cybrary",
        "year": "2019",
        "image": "/photo-1487058792275-0ad4aaf24ca7",
        "description": "Intermediate-level Course for undestanding different concepts of Cloud Security."
      },
      {
        "name": "NGD Linux Unhatched",
        "issuer": "Cybrary",
        "year": "2022",
        "image": "/photo-1487058792275-0ad4aaf24ca7",
        "description": "Foundation Course for undestanding linux commands and file systems."
      },
      {
        "name": "Huawei Certified ICT Associate",
        "issuer": "Huawei",
        "year": "2022",
        "image": "/photo-1487058792275-0ad4aaf24ca7",
        "description": "Expert-level Course for undestanding different concepts of Cloud Computing Using Huawei Cloud Softwares."
      },
      {
        "name": "Cisco CyberOps Associate",
        "issuer": "Cisco",
        "year": "2022",
        "image": "/photo-1487058792275-0ad4aaf24ca7",
        "description": "Expert-level Course for undestanding different concepts of CyberSecurity Operations."
      },
      {
        "name": "BCS Level 4 Certificate in IT",
        "issuer": "British Computer Society",
        "year": "2018",
        "image": "/photo-1487058792275-0ad4aaf24ca7",
        "description": "---"
      },
      {
        "name": "BCS Level 5 Diploma in IT",
        "issuer": "British Computer Society",
        "year": "2019",
        "image": "/photo-1487058792275-0ad4aaf24ca7",
        "description": "---"
      },
      {
        "name": "BCS Level 6 Professional Graduate Diploma in IT",
        "issuer": "British Computer Society",
        "year": "2019",
        "image": "/photo-1487058792275-0ad4aaf24ca7",
        "description": "---"
      }
    ]
  }
}